In [1]:
import mysql.connector as db
import pandas as pd

from IPython.display import display

In [6]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, FirstName, LastName, Semester1, Semester2, ABS(MarkGrowth) MarkGrowth from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID FirstName LastName  Semester1  Semester2  MarkGrowth
0          1      Jose    Mohit      64.55      72.60        8.05
1          2      Lala  Karlina      72.85      65.35        7.50
2          3    Sultan     Hadi      45.32      50.25        4.93
3          4      Jaya    Usman      86.73      77.40        9.33
4          5    Anjali   Wijaya      92.25      90.75        1.50

In [8]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, FirstName, LastName, ceiling(Semester1) Semester1, ceiling(Semester2) Semester2, ABS(MarkGrowth) MarkGrowth from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID FirstName LastName  Semester1  Semester2  MarkGrowth
0          1      Jose    Mohit       65.0       73.0        8.05
1          2      Lala  Karlina       73.0       66.0        7.50
2          3    Sultan     Hadi       46.0       51.0        4.93
3          4      Jaya    Usman       87.0       78.0        9.33
4          5    Anjali   Wijaya       93.0       91.0        1.50

In [10]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, FirstName, LastName, floor(Semester1) Semester1, floor(Semester2) Semester2, ABS(MarkGrowth) MarkGrowth from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID FirstName LastName  Semester1  Semester2  MarkGrowth
0          1      Jose    Mohit       64.0       72.0        8.05
1          2      Lala  Karlina       72.0       65.0        7.50
2          3    Sultan     Hadi       45.0       50.0        4.93
3          4      Jaya    Usman       86.0       77.0        9.33
4          5    Anjali   Wijaya       92.0       90.0        1.50

In [12]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, FirstName, LastName, round(Semester1) Semester1, round(Semester2) Semester2, ABS(MarkGrowth) MarkGrowth from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID FirstName LastName  Semester1  Semester2  MarkGrowth
0          1      Jose    Mohit       65.0       73.0        8.05
1          2      Lala  Karlina       73.0       65.0        7.50
2          3    Sultan     Hadi       45.0       50.0        4.93
3          4      Jaya    Usman       87.0       77.0        9.33
4          5    Anjali   Wijaya       92.0       91.0        1.50

In [14]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, FirstName, LastName, SQRT(Semester1) Semester1, SQRT(Semester2) Semester2, ABS(MarkGrowth) MarkGrowth from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID FirstName LastName  Semester1  Semester2  MarkGrowth
0          1      Jose    Mohit   8.034302   8.520563        8.05
1          2      Lala  Karlina   8.535221   8.083935        7.50
2          3    Sultan     Hadi   6.732013   7.088723        4.93
3          4      Jaya    Usman   9.312894   8.797727        9.33
4          5    Anjali   Wijaya   9.604686   9.526279        1.50

In [18]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, FirstName, LastName, mod(Semester1, 2) Semester1, exp(Semester2) Semester2, ABS(MarkGrowth) MarkGrowth from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID FirstName LastName  Semester1     Semester2  MarkGrowth
0          1      Jose    Mohit   0.550003  3.386716e+31        8.05
1          2      Lala  Karlina   0.849998  2.405159e+28        7.50
2          3    Sultan     Hadi   1.320000  6.657294e+21        4.93
3          4      Jaya    Usman   0.730003  4.115225e+33        9.33
4          5    Anjali   Wijaya   0.250000  2.583594e+39        1.50

In [21]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, concat(firstname, lastname) nama from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID          nama
0          1     JoseMohit
1          2   LalaKarlina
2          3    SultanHadi
3          4     JayaUsman
4          5  AnjaliWijaya

In [23]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  * from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

,StudentID,FirstName,LastName,Semester1,Semester2,MarkGrowth,email
0,1,Jose,Mohit,64.55,72.60,8.05,jose_mohit@gmail.com
1,2,Lala,Karlina,72.85,65.35,7.50,lala_karlina@gmail.com
2,3,Sultan,Hadi,45.32,50.25,4.93,sultan_hadi@gmail.com
3,4,Jaya,Usman,86.73,77.40,9.33,jaya_usman@gmail.com
4,5,Anjali,Wijaya,92.25,90.75,1.50,anjali_wijaya@gmail.com

In [25]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, substring_index(Email, '@', 1) nama from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID           nama
0          1     jose_mohit
1          2   lala_karlina
2          3    sultan_hadi
3          4     jaya_usman
4          5  anjali_wijaya

In [29]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, substr(FirstName, 2, 3) nama from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID nama
0          1  ose
1          2  ala
2          3  ult
3          4  aya
4          5  nja

In [31]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, length(FirstName) total_char from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID  total_char
0          1           4
1          2           4
2          3           6
3          4           4
4          5           6

In [34]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, Email, replace(email, 'gmail', 'zohomail') new_email from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID                    Email                   new_email
0          1     jose_mohit@gmail.com     jose_mohit@zohomail.com
1          2   lala_karlina@gmail.com   lala_karlina@zohomail.com
2          3    sultan_hadi@gmail.com    sultan_hadi@zohomail.com
3          4     jaya_usman@gmail.com     jaya_usman@zohomail.com
4          5  anjali_wijaya@gmail.com  anjali_wijaya@zohomail.com

In [36]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, upper(firstname) firstname, lower(lastname) lastname from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID firstname lastname
0          1      JOSE    mohit
1          2      LALA  karlina
2          3    SULTAN     hadi
3          4      JAYA    usman
4          5    ANJALI   wijaya

In [39]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, sum(semester1) total_semester1, sum(semester2) total_semester2 from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID  total_semester1  total_semester2
0          1       361.700005       356.349998

In [41]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  count(firstname) total_student from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   total_student
0              5

In [43]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, avg(semester1) total_semester1, avg(semester2) total_semester2 from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID  total_semester1  total_semester2
0          1        72.340001            71.27

In [44]:
connection = db.connect(
                        host="localhost",
                        database="dqlab_academy",
                        user="root",
                        password="MySQL"
                       )

query = "select  StudentID, min(semester1) min_semester1, max(semester1) max_semester1, min(semester2) min_semester2, max(semester2) max_semester2 from students"
dataset = pd.read_sql(query, connection)

if connection.is_connected():
    connection.close()
    print("MySQL is Close")

display(dataset)

MySQL is Close

   StudentID  min_semester1  max_semester1  min_semester2  max_semester2
0          1          45.32          92.25          50.25          90.75